{
    "title": "About Guruji",
    "content": "<h1>About Guruji Nirmal Singh Maharaj</h1><p><strong>Nirmal Singh (1952–2007)</strong>, affectionately known as <strong>Guruji</strong> by millions of devotees, was a beloved Indian spiritual leader who touched countless lives through his divine presence and blessings.</p><h2>Early Life</h2><p>Born on <strong>July 7, 1952</strong> in the village of Dugri, Punjab, Guruji displayed extraordinary spiritual abilities from a young age. Even as a child, his presence radiated divine energy that would transform the lives of those around him.</p><h2>Spiritual Journey</h2><p>Guruji emphasized the <strong>unity of all religions</strong>, focusing on love, compassion, and selfless service to humanity. He never delivered sermons; instead, he practiced what he called \"practical spirituality\" – transforming lives through direct experience and divine blessings.</p><p>His famous words <strong>\"Kalyan karta\"</strong> (May welfare be done) and <strong>\"Blessings always\"</strong> embodied his mission to bring healing and spiritual growth to all who sought his guidance.</p><h2>Bada Mandir - Chhatarpur, Delhi</h2><p>In the 1990s, Guruji established the magnificent <strong>Shiv Mandir</strong> (Bada Mandir) in the Chhatarpur area of Delhi. This serene temple has become a sacred pilgrimage site where devotees gather to experience his divine presence. Today, it serves as his samadhi shrine, continuing to radiate his blessings to all who visit.</p><h2>Daily Sangats</h2><p>Guruji held daily <strong>sangats</strong> (spiritual congregations) that included meditation, satsang, recitations of gurbani and shabad (hymns), and langar (community meals). These gatherings created a space where devotees could experience inner peace and divine connection.</p><h2>Miraculous Healings</h2><p>Countless devotees have shared experiences of miraculous healings and blessings received through Guruji's grace. The food served at his langar and the tea offered as prasad were believed to carry healing properties that cured diseases and transformed lives.</p><h2>Mahasamadhi - May 31, 2007</h2><p>On <strong>May 31, 2007</strong>, Guruji left his physical body, an event his devotees regard as <strong>mahasamadhi</strong> – a conscious exit from the physical world by an enlightened being. His teachings and blessings continue to guide millions of followers worldwide.</p><h2>Jai Guruji</h2><p>Today, devotees from all walks of life – including spiritual seekers, celebrities, and common people – continue to experience Guruji's divine presence. His message of love, surrender, and service lives on through the sangats held at Bada Mandir and around the world.</p><p style=\"text-align: center; font-size: 1.5em; margin-top: 30px;\"><strong>Jai Guruji!</strong></p>"
}